#include <stdio.h>

//int main()  // 隐式类型转换
//{
//	char a = 3;  // 整型截断
//	// 00000000000000000000000000000011 - 3
//	// 00000011 - a
//
//	char b = 127;  // 整型截断
//	// 00000000000000000000000001111111 - 127
//	// 01111111 - b
//
//	char c = a + b;  // 整型提升+整型截断
//	// 00000011 - a
//	// 01111111 - b
//	// 00000000000000000000000000000011 - 表达式中的a
//	// 00000000000000000000000001111111 - 表达式中的b
//	// 00000000000000000000000010000010 - a+b
//	// 10000010 - c
//
//	printf("%d\n", c);  // 整型提升
//	// 10000010 - c
//	// 11111111111111111111111110000010
//	// 11111111111111111111111110000001
//	// 10000000000000000000000001111110 - -126
//
//	return 0;
//}

//int main()
//{
//	char a = 0xb6;
//	// 00000000000000000000000010110110 - 0xb6
//	// 10110110 - a
//
//	short b = 0xb600;
//	// 00000000000000001011011000000000 - 0xb600
//	// 1011011000000000 - b
//
//	int c = 0xb6000000;
//	// 10110110000000000000000000000000 - 0xb6000000
//	// 10110110000000000000000000000000 - c
//
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//
//	return 0;
//}

//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));  // c所占内存空间的大小
//	printf("%u\n", sizeof(+c));  // 整型提升
//	printf("%u\n", sizeof(-c));  // 整型提升
//
//	return 0;
//}

//int main()  // 算术转换
//{
//	int a = 4;
//	float f = 4.5f;
//	float r = a + f;  // 将整型算术转换为精度更高的float类型
//
//	return 0;
//}

//int main()  // 操作符的优先级、结合性、是否控制求值顺序
//{
//	int a = 2;
//	int b = 4;
//
//	int c = a + b * 3;  // 相邻操作符先执行哪个，取决于它们的优先级
//	int d = a + b + 3;  // 如果两者的优先级相同，取决于它们的结合性
//	int e = (a + b) * 3;  // 某些操作符控制求值顺序
//
//	return 0;
//}

//int main()  // 指针
//{
//	int a = 10;
//	int* pa = &a;
//
//	char c = 'w';
//	char* pc = &c;
//
//	return 0;
//}

//int main()  // 指针类型的意义1
//{
//	int a = 0x11223344;
//
//	//int* pa = &a;
//	//*pa = 0;
//
//	char* pc = &a;
//	*pc = 0;
//
//	// 指针类型决定了指针解引用操作的时候，访问内存的大小为多少（访问几个字节）
//	// char* 指针解引用访问1个字节
//	// int* 指针解引用访问4个字节
//
//	return 0;
//}

//int main()  // 指针类型的意义2
//{
//	int a = 10;
//
//	int* pa = &a;
//	char* pc = &a;
//
//	printf("%p\n", pa);
//	printf("%p\n", pc);
//
//	printf("%p\n", pa + 1);
//	printf("%p\n", pc + 1);
//
//	printf("%p\n", pa + 2);
//	printf("%p\n", pc + 2);
//
//	// 指针类型决定了指针+-整数的时候，步长为多少（跳过几个字节）
//	// int* 指针+1跳过4个字节
//	// char* 指针+1跳过1个字节
//
//	return 0;
//}

//int main()  // 指针类型的实践
//{
//	int arr[10] = { 0 };  // 40个字节
//	int i = 0;
//
//	int* pa = arr;
//	for (i = 0; i < 10; i++)
//	{
//		*(pa + i) = 1;
//	}
//
//	char* pc = arr;
//	for (i = 0; i < 40; i++)
//	{
//		*(pc + i) = 1;
//	}
//
//	return 0;
//}

//int main()  // 野指针 - 指针未初始化
//{
//	int* p;  // 没有初始化，里边放的是随机值
//	*p = 20;  // 通过p中存的随机值作为地址，找到一个不属于当前的程序一个空间，就造成了非法访问，p为野指针
//
//	return 0;
//}

//int main()  // 野指针 - 指针越界访问
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//
//	int i = 0;
//	for (i = 0; i <= 10; i++)
//	{
//		*p = i;
//		p++;
//	}
//
//	return 0;
//}

int* test()
{
	int a = 10;
	return &a;
}

int main()  // 野指针 - 指针指向的空间释放
{
	int* p = test();

	printf("hehe\n");

	printf("%d\n", *p);

	return 0;
}