#include <stdio.h>

//int main()  // / - 操作数有浮点数时，结果是精确小数；操作数无浮点数时，结果是整除之后的商
//{
//	double ret1 = 5 / 2;
//	double ret2 = 5.0 / 2.0;
//	double ret3 = 5.0 / 2;
//	double ret4 = 5 / 2.0;
//	int ret5 = 5 / 2;
//
//	printf("%lf\n", ret1);
//	printf("%lf\n", ret2);
//	printf("%lf\n", ret3);
//	printf("%lf\n", ret4);
//	printf("%d\n", ret5);
//
//	return 0;
//}

//int main()  // % - 操作数必须为整型，结果是整除之后的余数
//{
//	int ret = 10 % 4;  // 2...2
//	printf("%d\n", ret);
//
//	return 0;
//}

// 整数在内存中以二进制存储，二进制有3种表现形式：原码、反码、补码
// 正整数：原码、反码、补码相同
// 负整数：原码、反码、补码是需要计算的
// 原码 - 直接按照数字的正负写出二进制序列，得到原码
// 反码 - 原码的符号位不变，其他位按位取反，得到反码
// 补码 - 反码的二进制序列+1，得到补码
// 整数在内存中存储的是补码，在CPU内计算的是补码，在屏幕上输出的是原码

//int main()  // << - 左移操作符，左边丢弃，右边补0
//{
//	int a = 5;
//	int b = a << 1;
//	// 00000000000000000000000000000101 - 5
//	// 00000000000000000000000000001010 - 10
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	int c = -1;
//	int d = c << 1;
//	// 10000000000000000000000000000001 - -1原码
//	// 11111111111111111111111111111110 - -1反码
//	// 11111111111111111111111111111111 - -1补码
//	// 11111111111111111111111111111110 - 补码
//	// 11111111111111111111111111111101 - 反码
//	// 10000000000000000000000000000010 - 原码-2
//	printf("%d\n", c);
//	printf("%d\n", d);
//
//	return 0;
//}

//int main()  // >> - 右移操作符，1、逻辑右移：右边丢弃，左边补0  2、算术右移：右边丢弃，左边补原符号位
//{
//	int a = 5;
//	int b = a >> 1;
//	// 00000000000000000000000000000101 - 5
//	// 00000000000000000000000000000010 - 2
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	int c = -1;
//	int d = c >> 1;
//	// 10000000000000000000000000000001 - -1原码
//	// 11111111111111111111111111111110 - -1反码
//	// 11111111111111111111111111111111 - -1补码
//	// 11111111111111111111111111111111 - 补码
//	// 11111111111111111111111111111110 - 反码
//	// 10000000000000000000000000000001 - 原码-1
//	printf("%d\n", c);
//	printf("%d\n", d);
//
//	return 0;
//}

int main()  // 对于移位操作符，不要移动负数位
{
	int a = 15;
	int b = a >> -1;  // err-标准未定义行为

	return 0;
}